person = 10
cook_book = [
  ['салат',
          [
            ['картофель', 100, 'гр.'],
            ['морковь', 50, 'гр.'],
            ['огурцы', 50, 'гр.'],
            ['горошек', 30, 'гр.'],
            ['майонез', 70, 'мл.'],
          ]
  ],
  ['пицца',
      [
        ['сыр', 50, 'гр.'],
        ['томаты', 50, 'гр.'],
        ['тесто', 100, 'гр.'],
        ['бекон', 30, 'гр.'],
        ['колбаса', 30, 'гр.'],
        ['грибы', 20, 'гр.'],
      ],
  ],
  ['фруктовый десерт',
      [
        ['хурма', 60, 'гр.'],
        ['киви', 60, 'гр.'],
        ['творог', 60, 'гр.'],
        ['сахар', 10, 'гр.'],
        ['мед', 50, 'мл.'],
      ]
  ]
]
if person == 1:
  print('Приготовим на :', person,'-го')
elif person > 1:
  print('Приготовим на :', person,'-х')
for list_ in cook_book:
  print(f'\n{list_[0].capitalize()} ;')
  for ingrid in list_[1]:
    print(' *',ingrid[0].capitalize(), ingrid[1] * person, ingrid[2])
